/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   normal.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyeonjan <hyeonjan@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/06 17:11:41 by hyeonjan          #+#    #+#             */
/*   Updated: 2023/03/06 17:11:41 by hyeonjan         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../../include/minirt.h"

// 광선의 방향벡터와 교점의 법선벡터의 내적이 음수이면 광선은 앞면(객체의)에 hit 한 것이다
// 여기서 밖에 안 쓰이면... 무쓸모...?
// 광선의 앞면에 hit 면 그대로 아니면 법선을 반대로 뒤집는다. (항상 광선 방향벡터와 법선 벡터를 반대인 상태로 사용하기위해)
void	set_face_normal(t_ray *primary_ray, t_hit_record *rec)
{
	if (!(vdot(primary_ray->dir, rec->normal) < 0))
		rec->normal = vmult(rec->normal, -1);
}
